name: "weather_gencast_demo_model"
backend: "python"

input [
  {
    name: "input_nc"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  { name: "output_array" data_type: TYPE_FP32 dims: [ 8, 1, 1, 181, 360 ] }
]

instance_group [
  {
    kind: KIND_GPU
  }
]
